HE1/constant/COLD/turbulenceProperties
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"constant/COLD";
	object	turbulenceProperties;
}
simulationType	laminar;
