HE1/constant/HOT/turbulenceProperties
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"constant/HOT";
	object	turbulenceProperties;
}
simulationType	laminar;
