HE1/constant/COLD/MRFProperties
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"constant/COLD";
	object	MRFProperties;
}
