HE1/constant/HOT/MRFProperties
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"constant/HOT";
	object	MRFProperties;
}
