HE1/constant/HOT/boundaryRadiationProperties
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"constant/HOT";
	object	boundaryRadiationProperties;
}
exchanger
{
}
exchanger_hot_in
{
}
exchanger_hot_out
{
}
pipes
{
}
pipes_baffle_in
{
}
pipes_baffle_out
{
}
