HE1/constant/dynamicMeshDict
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"constant";
	object	dynamicMeshDict;
}
dynamicFvMesh	staticFvMesh;
