HE1/0/COLD/U
FoamFile
{
	version	2.0;
	format	binary;
	class	volVectorField;
	location	"0/COLD";
	object	U;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[0 1 -1 0 0 0 0];
internalField	uniform (0.0 0.02 0.0);
boundaryField
{
	baffles
	{
		type	noSlip;
	}
	baffles_slave
	{
		type	noSlip;
	}
	exchanger
	{
		type	noSlip;
	}
	exchanger_cold_in
	{
		type	surfaceNormalFixedValue;
		refValue	uniform -0.15;
	}
	exchanger_cold_out
	{
		type	pressureInletOutletVelocity;
		value	uniform (0.0 0.02 0.0);
	}
	pipes
	{
		type	noSlip;
	}
	pipes_baffle_in
	{
		type	noSlip;
	}
	pipes_baffle_out
	{
		type	noSlip;
	}
}
