HE1/0/HOT/U
FoamFile
{
	version	2.0;
	format	binary;
	class	volVectorField;
	location	"0/HOT";
	object	U;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[0 1 -1 0 0 0 0];
internalField	uniform (0.0 0.0 0.02);
boundaryField
{
	exchanger
	{
		type	noSlip;
	}
	exchanger_hot_in
	{
		type	surfaceNormalFixedValue;
		refValue	uniform -0.03;
	}
	exchanger_hot_out
	{
		type	pressureInletOutletVelocity;
		value	uniform (0.0 0.0 0.02);
	}
	pipes
	{
		type	noSlip;
	}
	pipes_baffle_in
	{
		type	noSlip;
	}
	pipes_baffle_out
	{
		type	noSlip;
	}
}
