HE1/0/HOT/p_rgh
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0/HOT";
	object	p_rgh;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[1 -1 -2 0 0 0 0];
internalField	uniform 100000.0;
boundaryField
{
	exchanger
	{
		type	fixedFluxPressure;
	}
	exchanger_hot_in
	{
		type	fixedFluxPressure;
	}
	exchanger_hot_out
	{
		type	fixedValue;
		value	uniform 100000.0;
	}
	pipes
	{
		type	fixedFluxPressure;
	}
	pipes_baffle_in
	{
		type	fixedFluxPressure;
	}
	pipes_baffle_out
	{
		type	fixedFluxPressure;
	}
}
