HE1/system/hot/fvSolution
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"system/HOT";
	object	fvSolution;
}
solvers
{
	p_rgh
	{
		solver	GAMG;
		smoother	GaussSeidel;
		relTol	0.01;
		cacheAgglomeration	true;
		nFinestSweeps	2;
		nPreSweeps	0;
		maxIter	100;
		nPostSweeps	1;
		agglomerator	faceAreaPair;
		nCellsInCoarsestLevel	10;
		tolerance	1.0E-6;
		mergeLevels	1;
	}
	U
	{
		solver	smoothSolver;
		smoother	GaussSeidel;
		nSweeps	2;
		relTol	0.01;
		tolerance	1.0E-6;
		maxIter	100;
	}
	h
	{
		solver	PBiCGStab;
		relTol	0.01;
		preconditioner	DILU;
		tolerance	1.0E-6;
		maxIter	100;
	}
	rho
	{
		solver	PCG;
		relTol	0.01;
		preconditioner	DIC;
		tolerance	1.0E-6;
		maxIter	100;
	}
}
PIMPLE
{
	nNonOrthogonalCorrectors	1;
	momentumPredictor	true;
	residualControl
	{
		p_rgh	1.0E-4;
		U	1.0E-4;
		h	1.0E-4;
		rho	1.0E-4;
	}
	pRefCell	0;
	pRefValue	100000.0;
}
relaxationFactors
{
	p_rgh	0.7;
	U	0.3;
	h	0.6;
	rho	0.6;
	h	0.7;
}
