HE1/system/cold/changeDictionaryDict
FoamFile
{
	version	2.0;
	format	binary;
	class	dictionary;
	location	"system/COLD";
	object	changeDictionaryDict;
}
p_rgh
{
	boundaryField
	{
		baffles
		{
			type	fixedFluxPressure;
		}
		baffles_slave
		{
			type	fixedFluxPressure;
		}
		exchanger
		{
			type	fixedFluxPressure;
		}
		exchanger_cold_in
		{
			type	fixedFluxPressure;
		}
		exchanger_cold_out
		{
			type	fixedValue;
			value	uniform 100000.0;
		}
		pipes
		{
			type	fixedFluxPressure;
		}
		pipes_baffle_in
		{
			type	fixedFluxPressure;
		}
		pipes_baffle_out
		{
			type	fixedFluxPressure;
		}
	}
}
p
{
	boundaryField
	{
	}
}
U
{
	boundaryField
	{
		baffles
		{
			type	noSlip;
		}
		baffles_slave
		{
			type	noSlip;
		}
		exchanger
		{
			type	noSlip;
		}
		exchanger_cold_in
		{
			type	surfaceNormalFixedValue;
			refValue	uniform -0.15;
		}
		exchanger_cold_out
		{
			type	pressureInletOutletVelocity;
		}
		pipes
		{
			type	noSlip;
		}
		pipes_baffle_in
		{
			type	noSlip;
		}
		pipes_baffle_out
		{
			type	noSlip;
		}
	}
}
T
{
	boundaryField
	{
		baffles
		{
			type	zeroGradient;
		}
		baffles_slave
		{
			type	zeroGradient;
		}
		exchanger
		{
			type	zeroGradient;
		}
		exchanger_cold_in
		{
			type	totalTemperature;
			T0	uniform 283.0;
			gamma	1.124;
		}
		exchanger_cold_out
		{
			type	zeroGradient;
		}
		pipes
		{
			type	compressible::turbulentTemperatureRadCoupledMixed;
			qrNbr	none;
			qr	none;
			neighbourFieldName	T;
			kappaMethod	fluidThermo;
			kappa	none;
			Tnbr	T;
			thicknessLayers	(0.005);
			kappaLayers	(385.0);
		}
		pipes_baffle_in
		{
			type	compressible::turbulentTemperatureRadCoupledMixed;
			qrNbr	none;
			qr	none;
			neighbourFieldName	T;
			kappaMethod	fluidThermo;
			kappa	none;
			Tnbr	T;
			thicknessLayers	(0.005);
			kappaLayers	(385.0);
		}
		pipes_baffle_out
		{
			type	compressible::turbulentTemperatureRadCoupledMixed;
			qrNbr	none;
			qr	none;
			neighbourFieldName	T;
			kappaMethod	fluidThermo;
			kappa	none;
			Tnbr	T;
			thicknessLayers	(0.005);
			kappaLayers	(385.0);
		}
	}
}
