HE1/system/foamDataToFluentDict
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"system";
	object	foamDataToFluentDict;
}
p	1;
epsilon	6;
p_rgh	1;
T	3;
U	2;
h	4;
k	5;
Urel	2;
omega	63;
